<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"ea9d23df013a6cba30ffc035315548d11116e4d24d4f8700fc74bb06d70ebd3b","plan_job_ref":"Job Test terraform-apply #718 at https://github.com/dflook/terraform-github-actions/actions/runs/14145362752","plan_out_hash":"15d5c31eaaec21d2235c9151e5e176617a3652eead94c7c399ecbf18db07138d","plan_hash":"aca62511b4a1b87cfb2ce3e533553f3e0601f9a4f66140fae302f30ebf130367","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-apply/long_outputs__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.s will be created
+   resource "random_string" "s" {
+       id          = (known after apply)
+       length      = 200
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   output  = <<-EOT
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
        This is my long string.
    EOT
+   unknown = (known after apply)
```
</details>

:memo: Plan generated in [Test terraform-apply #718](https://github.com/dflook/terraform-github-actions/actions/runs/14145362752)